app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'abbyyygarciaa@gmail.com'
 LIMIT 1
---
    public function checkLogin()
    {
        $session   = session();
        $userModel = new UserModel();

        $email    = trim($this->request->getPost('email'));
        $password = (string) $this->request->getPost('password');

        // ✅ Validate input
        if ($email === '' || $password === '') {
            $session->setFlashdata('error', 'Please enter email and password.');
            return redirect()->to('/auth/login')->withInput();
        }

        // ✅ Find user
        $user = $userModel->where('email', $email)->first();