app/Controllers/staff.php

SELECT DISTINCT `branch_address`
FROM `products`
WHERE `branch_address` IS NOT NULL
AND `branch_address` != ''
ORDER BY `branch_address`
---
    public function dashboard()
    {
        $session = session();

        // Auth check - allow inventory staff and managers
        if (!$session->get('logged_in') || !in_array($session->get('role'), ['inventorystaff', 'inventory_staff', 'branch_manager', 'manager'])) {
            return redirect()->to('/auth/login');
        }

        // Filters
        $filters = [
            'search'         => $this->request->getGet('search'),
            'branch_address' => $this->request->getGet('branch_address'),
            'status'         => $this->request->getGet('status'),
            'date'           => $this->request->getGet('date'),
        ];

        // Get inventory items
        $items = $this->model->getInventory($filters);

        // Get branches from products table
        $branches = $this->db->table('products')
            ->distinct()
            ->select('branch_address')
            ->where('branch_address IS NOT NULL')
            ->where('branch_address !=', '')
            ->orderBy('branch_address')
            ->get()
            ->getResultArray();

        return view('dashboards/staff', [
            'items'    => $items,
            'branches' => $branches,
            'filters'  => $filters,
            'me'       => [
                'email' => $session->get('email'),
                'role'  => $session->get('role'),
            ],
        ]);