app/Models/ProductModel.php

    public function getInventory(array $filters = []): array
    {
        $builder = $this->builder();

        // Branch filter
        if (!empty($filters['branch_address']) && $filters['branch_address'] !== 'all') {
            $builder->where('branch_address', $filters['branch_address']);
        }

        // Status filter
        if (!empty($filters['status']) && $filters['status'] !== 'all') {
            $builder->where('status', $filters['status']);
        }

        // Date filter
        if (!empty($filters['date'])) {
            $builder->where('DATE(created_at)', $filters['date']);
        }

        // Search filter
        if (!empty($filters['search'])) {
            $builder->groupStart()
                ->like('name', $filters['search'])
                ->orLike('category', $filters['search'])
                ->orLike('branch_address', $filters['search'])
                ->groupEnd();
        }

        $items = $builder->orderBy('created_at', 'DESC')->get()->getResultArray();
---
SELECT *
FROM `products`
ORDER BY `created_at` DESC